Repository: NoopikxD/PromtTest
Catalog: CorpusSearch/CorpusSearch/en-ru.tmx
Source language: en
Languages: ru

source: Hell, yeah!
ru: Чёрт возьми, конечно, да!

source: Play ball!
ru: Мяч в игре!

source: Strike.
ru: Бой.

source: He' s out!
ru: Очко!

source: - Strike!
ru: - Бой!

source: - It' s all right, Ray Ray.
ru: - Всё в порядке, Рэй Рэй.

source: Strike!
ru: Бой!

source: - Throw it!
ru: - Бросай его!

source: Damn!
ru: Чёрт!

source: Get down now!
ru: Падай!

source: - Safe!
ru: - Дом!

source: Oh, my God, he caught it.
ru: О, господи, он поймал его.

source: Throw it!
ru: Бросай!

source: What the hell -- Damn it!
ru: Да что за дерьмо!

source: - Okay, I' m gonna break your ass!
ru: - Хорошо, я сейчас надеру тебе зад!

source: - What the hell is wrong with you?
ru: - Какого чёрта с тобой происходит?

source: Come on, baby, you can do this.
ru: Давай, ты же можешь это сделать.

source: - Keep goin ', Kofi!
ru: - Продолжай бежать, Кофи!

source: Come on, Kofi!
ru: Давай, Кофи!

source: Safe!
ru: Дом!

source: That' s the way to take your cuts.
ru: Так ты научишься играть.

source: - Coach, I guess that' s it.
ru: - Тренер, я полагаю, что пора заканчивать.

source: I mean, the league says we can' t start another inning after 6: 30.
ru: Я хочу сказать, что лига запрещает начинать новую игру позже 6. 30.

source: - Well, yeah.
ru: - Ну, да.

source: - That' s cool.
ru: - Хорошо.

source: - Good luck the rest of the way.
ru: - Удачи.

source: Two, four, six, eight, who do we appreciate?
ru: Два, четыре, шесть, восемь, у кого прощенья просим?

source: Kekambas!
ru: Кекамбас!

source: Damn, Miles, you don' t even know how to throw the ball!
ru: Чёрт, Майлс, ты хоть знаешь, как бросать мяч!

source: Shut up, Ray Ray.
ru: Заткнись Рэй Рэй.

source: At least he ran after it when it went by.
ru: В конце концов какая теперь разница.

source: Shit went through your legs like five damn times.
ru: Ты пропустил мяч между ног, как пятилетний.

source: You a little punk, Dre.
ru: Ты просто маленький педик, Дрэ.

source: Least you throw like one.
ru: И бросаешь как один из них.

source: I' m tired of your shit, bitch.
ru: Чёрт, ты достал меня.

source: - Kick his ass!
ru: - Пни ему по заднице!

source: - Hey, that' s it!
ru: - Эй, хватит!

source: - I' m gonna kill you!
ru: - Я убью тебя!

source: - Kofi, you' re close to being done.
ru: - Кофи, не горячись.

source: - I quit!
ru: - Я ухожу!

source: - This team sucks, man!
ru: - Это команда сосунков, мужик!

source: - Oh, hell, no.
ru: - О, чёрт, нет.

source: This is you, Dre.
ru: Это всё ты Дре.

source: - This is all your fault, Dre.
ru: - Ты во всём виноват, Дре.

source: Anybody hungry?
ru: Кто- нибудь проголодался?

source: How 'bout pizza?
ru: Как насчёт пиццы?

source: I' m down with that shit, my brother.
ru: Вот это по мне, братишка.

source: You got three large pies, 11 pops.
ru: И того 3 больших пиццы и 11 стаканчиков.

source: It' s 44. 65.
ru: С вас 44. 65 долларов.

source: You like hockey?
ru: Вы любите хоккей?

source: Blackhawks fans?
ru: Блэккхавкс нравятся?

source: I take the wife and kids every year to the Negro Hockey Hall of Fame.
ru: Я каждый год вожу жену и детей в зал славы негритянских хоккеистов.

source: Man, the only thing black at a Blackhawk game is the puck.
ru: Мужик, единственный чёрный, играющий за них, и тот голубой.

source: I' il give you two loge seats for the Bulls/ Mavericks on Sunday.
ru: Я дам вам два билета на места в ложе на Быки\ Маверики на завтра.

source: - For the pizza?
ru: - За пиццу?

source: - For the pizza.
ru: - За пиццу.

source: Done deal.
ru: По рукам.

source: Yo, Coach!
ru: Эй, тренер!

source: If I get a home run next game, you gotta buy me pizza again.
ru: Если я добегу до дома в следующей игре, ты мне купишь пиццу?

source: Every run I score, I get one slice.
ru: За каждое очко, кусок пиццы.

source: You bustas is trippin '.
ru: Вы глупцы.

source: Only me gettin 'pizza every game.
ru: Только мне положена пицца каждую игру.

source: MVP -- Most Valuable Pizza eater.
ru: СГП -- Самый главный пиццепоедатель.

source: Yo, Coach, I should be pitching.
ru: Йоу, тренер, Я должен быть бросающим.

source: - You wanna pitch, Miles?
ru: - Ты хочешь бросать, Майлс?

source: You can pitch on Wednesday.
ru: Ты можешь начать во вторник.

source: Coach, is there any chance that we' il get trophies this year?
ru: Тренер, есть шанс того, что мы попадём в чемпионат в этом году?

source: There are eight teams in the league... play everyone twice --
ru: Играют с каждым дважды --

source: We gotta win more games than we lose.
ru: Нам нужно выиграть больше игр, чем проиграть.

source: - So we go to the 'ship, right?
ru: - И мы попадём в финал, да?

source: - Yeah, we could.
ru: - Да, может быть.

source: - Man, we goin 'to the' ship.
ru: - Мы попадём туда.

source: We goin 'to the' ship, whoa.
ru: Мы пройдём в финал, уау.

source: We goin 'to the' ship.
ru: Мы попадём в финал.

source: All right, Andre.
ru: Хорошо, Андрэ.

source: This is it, right?
ru: Это здесь, верно?

source: Don' t you wanna see my house?
ru: Не хочешь посмотреть мой дом?

source: Everyone' s sittin 'on the floor.
ru: Все сидят на полу.

source: You stay below the window.
ru: И ты не стой у окна.

source: Bullets.
ru: Пули.

source: What do you do around here for fun?
ru: А как вы здесь развлекаетесь?

source: Play baseball with you.
ru: Играем в бейсбол с вами.

source: - See ya on Wednesday.
ru: - Увидимся во вторник.

source: You ready, Miles?
ru: Ты готов, Майлс?

source: Want me to hold your Walkman?
ru: Не хочешь дать мне плеер?

source: Come on, Miles.
ru: Давай, Майлс.

source: You do your stuff now.
ru: Делай вещи.

source: - Let' s go, pitcher!
ru: - Давай, бросай!

source: - Come on, Miles!
ru: - Давай, Майлс!

source: - Damn.
ru: - Чёрт.

source: - What' s he listenin 'to?
ru: - Что он слушает?

source: - Same song...
ru: - Одну песню...

source: - over and over.
ru: - снова и снова.

source: - What is it?
ru: - Что за песня?

source: "Big Poppa" by Notorious B. I. G.
ru: "Биг Поппа" Ноторионс Б. И. Г.

source: Want one of his tapes?
ru: Хочешь такую кассету?

source: He made five of 'em.
ru: У него их пять.

source: How' s it go?
ru: А о чём она?

source: I love it when you call me Big Poppa
ru: Я люблю, когда ты зовёшь меня Биг Поппа

source: I see some ladies tonight that should be havin 'my baby, baby
ru: Он крутит своими руками в воздухе если ты настоящий игрок ты встретишь девушку сегодня которая будет твоей крошкой, крошкой

source: We won our last game.
ru: Мы выиграли нашу последнюю игру.

source: Miles is an amazing pitcher.
ru: Майлс невероятно бросает.

source: Oh, I heard.
ru: О, я слышала.

source: Nine to three over the Gandas.
ru: Девять три в вашу пользу.

source: I' m just helping out till my colleague returns from New York.
ru: Я просто помогаю, пока мой коллега не вернётся из Нью Йорка.

source: - You' re great to take the time out.
ru: - Вы не теряете времени даром.

source: - Hey, listen... why don' t we have dinner tonight?
ru: - Эй, послушайте...

source: What good is an expense account if you don' t pad it once in a while?
ru: Почему бы нам сегодня не поужинать?

source: It' s a school night.
ru: Эта ночь для работы.

source: - Maybe some other time.
ru: - Как нибудь в другой раз.

source: - After the game on Saturday?
ru: - Может после игры в субботу?

source: - Saturday.
ru: - Суббота.

source: - The boys would love you to come.
ru: - Ребята хотели бы, чтоб вы пришли.

source: You' re not really tryin 'to get Miss Wilkes, are you?
ru: Ты же не пытаешься закадрить мисс монашку, а?

source: 'Cause I already tried, and she ain' t havin' it.
ru: Потому что я уже пробовал, ничего не вышло.

source: Do it, Jamal!
ru: Давай, Джамал!

source: Kofi wanna come back... but first I have to "regotiate" his contract.
ru: Кофи хочет вернуться... но сначала я должен "обсудить" его контракт.

source: - Ball one!
ru: - Первый мяч!

source: - What are the terms?
ru: - Каковы условия?

source: - One, you tell Andre... that Kofi' s the best player.
ru: - Первое, ты скажешь Андрэ... что Кофи лучший игрок.

source: Two, only Kofi gets pizza when he hits a home run.
ru: Второе, только Кофи получает пиццу, когда прибегает в дом.

source: Three, if he whacks it over the gate, he gets a pizza to take home.
ru: Третье, если он выбьет мяч за пределы поля, он может забрать пиццу домой.

source: One, when the season' s over, the team votes on who' s the best player.
ru: Первое, когда сезон закончится, команда голосованием выберет лучшего игрока.

source: Two, Kofi can have the same pizza bonuses as everyone else.
ru: Второе, Кофи получит столько же пиццы, сколько и остальные.

source: Three, if he hits it over the fence...
ru: Третье, если он всё- таки выбьет мяч за пределы поля...

source: I' il buy him a pizza.
ru: Я куплю ему пиццу.

source: Let me discuss the regotiations with my client.
ru: Я должен обсудить условия контракта с моим клиентом.

source: Put your back into it, Jefferson!
ru: Давай Джефферсон!

source: Here!
ru: Сюда!

source: Light this sucker up!
ru: Давай зададим этим ублюдкам!

source: - Go, baby!
ru: - Давай, детка!

source: - One more run!
ru: - Ещё один поворот!

source: What' s up, Coach?
ru: Тренер?

source: Kofi Evans.
ru: Кофи Эванс.

source: - I spoke to your agent.
ru: - Я говорил с твоим агентом.

source: - I can come back?
ru: - Я могу вернуться?

source: If it' s cool with the team.
ru: Если команда тебя примет.

source: But you start shit with Andre... and you' re done -- okay?
ru: Но ты же опять начнёшь это дерьмо с Андрэ... вообщем ты принят -- понял?

source: - Run!
ru: - Беги!

source: - You' re out!
ru: - Беги!

source: The Kintus!
ru: Кинтус!

source: Yea, Kintus!
ru: Да, Кинтус!

source: You' re great with them.
ru: Вы молодцы.

source: Are we on for tonight?
ru: Как насчёт сегодня?

source: - Tonight?
ru: - Сегодня?

source: - It' s not a school night.
ru: - Эта ночь не для работы.

source: Come on -- just for dinner.
ru: Давай -- просто ужин.

source: People can hear your screams.
ru: Выберем место, где люди не услышат, как ты кричишь.

source: I' m not sure.
ru: Я не уверена.

source: It' s on the corner of Clark and Addison -- Slugger' s.
ru: Закусочная, на углу Кларк и Эддисон.

source: How 'bout 9: 00?
ru: Как насчёт 9. 00?

source: Clark and Addison.
ru: Кларк и Эддисон.

source: Did you miss a payment with the Barber?
ru: Ты помнишь, что нужно платить Барберу?

source: I shined him this week.
ru: Я его видел на этой неделе.

source: That goofy dork Gino came into Duffy' s asking for you.
ru: Этот придурок Джино приходил к Даффи и спрашивал о тебе.

source: - Ticky, this is Ed.
ru: - Тикки, это Эд.

source: - Ed.
ru: - Эд.

source: - How you doin '?
ru: - Как дела?

source: - Pleasure.
ru: - Нормально.

source: He wanted to meet you.
ru: Это Конор Онил, он хотел с тобой познакомиться.

source: What do you do for money?
ru: Как ты делаешь деньги?

source: I' m a trader at Smyth and Stevens.
ru: Я дилер в Смит энд Стивенс.

source: First lie.
ru: Дерьмо собачье.

source: You gonna beat me one time so you can pay off whoever else you owe?
ru: Первый неправильный ответ.

source: - I wanna make a big bet.
ru: - Я хочу сделать большую ставку.

source: - How big?
ru: - Насколько большую?

source: - Twelve grand.
ru: - Двенадцать штук.

source: - And?
ru: - И?

source: And, if I win...
ru: И если я выиграю...

source: I wanna get paid.
ru: Я хочу расплатиться.

source: No bullshit to keep bettin 'it.
ru: Я не шучу.

source: This guy' s too serious.
ru: Эти парни слишком серьёзны.

source: I got a handful of clients, they lay a hundred grand a week.
ru: У меня полно клиентов, которые ставят сотни тысяч в неделю.

source: - They' re not emotional about it.
ru: - Даже они так не нервничают.

source: - I can cover it.
ru: - Я могу заплатить.

source: Desperate.
ru: А ты так нервничаешь из- за вшивых двенадцати штук.

source: What are you, a psychiatrist or a bookie?
ru: Кто ты, психиатр или букмекер?

source: Don' t you want your number?
ru: Ты не хочешь получить номер?

source: You gonna take my bet?
ru: Вы примете мою ставку?

source: - Ed, what' s the next number?
ru: - Эд, какой следующий номер?

source: You' re account 27 when you call in.
ru: Твоя ставка будет принята, когда ты позвонишь сюда.

source: And your handle is?
ru: Твоё имя?

source: Kekambas.
ru: Кекамбас.

source: Kekambas?
ru: Кекамбас?

source: - Kekambas.
ru: - Кекамбас.

source: - Ed, you got it?
ru: - Эд, уловил?

source: - You' re a strange kid, Kekambas.
ru: - Ты странный парень, Кекамбас.

source: I' m interested to see what happens with you.
ru: Мне интересно, что с тобой будет.

source: Gino, get him.
ru: Джино, лови его.

source: Fuck this.
ru: Чёрт.

source: Account 27.
ru: Номер 27.

source: What' s the line on Chicago tomorrow night against Miami?
ru: Как насчёт игры Быки против Майами?

source: Gimme Miami minus six.
ru: Майами минус шесть.

source: Twelve grand.
ru: Двенадцать штук.

source: I' il take Chicago and the six points.
ru: Я ставлю против Чикаго, шесть очков.

source: Twelve thousand.
ru: Двенадцать тысяч.

source: - Let' s eat.
ru: - Давай перекусим.

source: Why don' t we sit?
ru: Почему бы нам ни присесть?

source: So, I wanted to talk to you.
ru: Итак, я хотела поговорить с тобой.

source: Yeah, I wanted to talk to you too.
ru: Да, я тоже хотел поговорить с тобой.

source: - Do you want a drink?
ru: - Хочешь выпить?

source: I come here all the time with the guys I work with.
ru: Я шёл сюда, а по дороге думал о мальчишках, с которыми я работаю.

source: Look, I know you don' t work at Smyth and Stevens.
ru: Слушай, я знаю, что ты не работаешь в Смит энд Стивенс.

source: I could tell right away you weren' t a broker.
ru: Я прямо глядя на тебя могу сказать, что ты не брокер.

source: What' s that mean?
ru: Что ты имеешь в виду?

source: You just don' t look like you work at Smyth and Stevens.
ru: Ты просто не выглядишь так, будто работаешь в Смит энд Стивенс.

source: You look like a freakin 'boring schoolteacher.
ru: А ты выглядишь, как стервозная, скучная учительница.

source: Hey, why' d you come here?
ru: Эй, для чего мы сюда пришли?

source: To bust me in the lie about where I work?
ru: Обсуждать то, что я солгал насчёт работы?

source: You win.
ru: Твоя взяла.

source: You coach my kids.
ru: Ты тренируешь моих детей.

source: I thought we had a common interest.
ru: Я думала, мы преследуем одни интересы.

source: Elizabeth, I get paid under the table to coach that team.
ru: Элизабет, я плачу по счетам, тренируя эту команду.

source: 'cause I' m in a big hole with two bookies who are lookin' to kill me.
ru: И я делаю это только потому что... два огромных букмекера ищут меня, чтобы убить.

source: You know all this.
ru: Ты наверное знаешь об этом.

source: I spoke to Jimmy Fleming after Jefferson got beat up.
ru: Я говорила с Флемингом после того, как побили Джефферсона.

source: He told me.
ru: Он рассказал мне.

source: - You just think I' m a big joke.
ru: - Ты думаешь, что я просто одно большое недоразумение.

source: You know, it' s people like me that make people like you... feel better about your tiny life.
ru: Есть люди вроде меня, которые делают людей вроде тебя... счастливей, в их жалкой жизни.

source: This is unbelievable.
ru: Это невероятно.

source: I can' t believe I came down here for this.
ru: Я не могу поверить, что я приехала сюда, чтобы выслушивать это.

source: Then why did you come if you know I' m a liar?
ru: Тогда зачем ты приехала, если знала, что я лжец?

source: Because those kids trust you.
ru: Потому что дети верят тебе.

source: And they don' t trust anybody.
ru: И больше никому.

source: - I told you, I coach for money.
ru: - Я же говорю, я тренирую из- за денег.

source: - Well, I teach for money.
ru: - Что ж, а я учу за деньги.

source: I' ve had the best fifth graders in the world, but some don' t make it.
ru: У меня может быть пять самых лучших учеников в мире, Но я ничего не могу сделать.

source: There' s nobody besides their mother or me telling them what to do.
ru: Потому что никто, кроме меня и их матерей не говорит им, что нужно делать.

source: So what?
ru: Ну и что?

source: I' m done with all that.
ru: С меня достаточно.

source: Well, I just came down here to see what they see... because they' re never wrong.
ru: Ну, я просто пришла, чтобы посмотреть на то, о чём они говорят... потому, что они никогда не ошибаются.

source: Take a good look.
ru: Смотри внимательно.

source: See what they see.
ru: Ты видишь то, что они видят.

source: - I came to talk to you about a job.
ru: - Я приехала, чтобы поговорить с тобой о работе.

source: Well, unless it pays 12 grand an hour...
ru: Ну, если там платят меньше 12 штук в час...

source: I' m not interested.
ru: То мне это не интересно.

source: - Did you play it?
ru: - Ты в деле?

source: - Twelve grand?
ru: - Двенадцать штук?

source: - Coach!
ru: - Тренер!

source: Can we have a word?
ru: Можно мне сказать?

source: - How many points you givin '?
ru: - На сколько очков ты поставил?

source: I' m getting six.
ru: На шесть.

source: You took Chicago?
ru: Ты поставил на Чикаго?

source: Are you on crack?
ru: Ты с ума сошёл?

source: - You laid 12 grand on those -- - I' m under a lot of pressure.
ru: - Ты поставил 12 штук на этих -- - Я нахожусь под большим давлением.

source: - I said now!
ru: - Я сказал, сейчас!

source: - Win or lose, I' m outta here.
ru: - Выиграю или проиграю, теперь уже всё равно.

source: - Darryl Mackey, league' s president.
ru: - Даррел Маккей, президент лиги.

source: - We met.
ru: - Мы знакомы.

source: Coach, we' re concerned about the age of some of the boys on your team.
ru: Тренер, мы озабочены возрастом некоторых игроков из вашей команды.

source: Can you produce birth certificates for your players?
ru: Вы можете предоставить их свидетельства о рождении?

source: All I got is what Coach Fleming at Smyth and Stevens gave me.
ru: Всё, что у меня есть, это то, что Флеминг передал мне.

source: Here they are.
ru: Вот они.

source: What are the names of those two boys at second base?
ru: Как зовут тех ребят на второй базе?

source: - Andre and Jamal.
ru: - Андрэ и Джамал.

source: - Which one' s Jamal?
ru: - Кто из них Джамал?

source: The taller one.
ru: Тот, что выше.

source: This birth certificate' s been altered.
ru: Его свидетельство изменено.

source: The eight' s been turned into a nine.
ru: Восемь переправлено на девять.

source: You have to be born after September of '88.
ru: У нас играют ребята родившиеся только после сентября 88 года.

source: Well, the kid is out of the league, and the Kekambas are on probation.
ru: Итак, у команды проблемы.

source: Look, what are you guys -- the cops?
ru: Слушайте, кто вы, полицейские?

source: What' s the point of the league, Coach?
ru: Какова суть лиги, тренер?

source: To teach kids it' s okay to lie, as long as they can get away with it?
ru: Учить детей врать, так долго как они смогут?

source: It should be about these kids playing ball... not the trophy you bring to work.
ru: Это должно быть обучение детей игре... не за награду, ради которой вы работаете.

source: Look, the kid goes now.
ru: Послушай, парень уйдёт сейчас.

source: Okay?
ru: Хорошо?

source: Jefferson bats seventh, plays first base.
ru: Джефферсон, номер семь, играет на второй базе.

source: Miles pitches and bats eighth, and Clarence... you play third and bat ninth.
ru: Майлс бросает номер восемь, и Кларенс... ты играешь на третьей базе, твой номер девятый.

source: - Cool.
ru: - Круто.

source: - Okay, let' s go.
ru: - Ладно, поехали.

source: You mad at me?
ru: Почему я не играю?

source: Jamal, the other coach --
ru: Джамал, другие тренера --

source: 'Cause I' m sorry about pushing Ray Ray.
ru: Я извиняюсь, что толкал Рэй Рэя.

source: I just want to play.
ru: Я просто хочу играть.

source: They know you changed your birth certificate.
ru: Они знают, что ты исправил своё свидетельство.

source: I can' t let you play.
ru: Я не могу позволить тебе играть.

source: But my mom said it was okay.
ru: Но мама сказала, что всё в порядке.

source: She said that she would tell them if they asked.
ru: Она сказала, что скажет им если они спросят.

source: She said it was okay.
ru: Она сказала, что всё в порядке.

source: - I just wanna play.
ru: - Я просто хочу играть.

source: - There' s nothin 'I can do.
ru: - Я ничего не могу поделать.

source: Look, why don' t you just sit --
ru: Слушай, почему бы тебе просто не посидеть --

source: Miles, do your stuff now.
ru: Майлс, делай вещи.

source: That' s what I' m talkin 'about.
ru: Вот о чём я тебе говорил.

source: Time, Blue.
ru: Таймаут, голубые.

source: I can' t have this kid out here with these things on.
ru: Я не могу дать этому парню играть с этой дрянью на ушах.

source: - What now?
ru: - Что теперь?

source: - We' re just all in agreement.
ru: - Мы просто пришли к соглашению.

source: The kid can' t wear headphones while he pitches.
ru: Парень не может бросать в наушниках.

source: Matt makes a good point about safety.
ru: Мэтт беспокоится о безопасности.

source: You' re kidding me, right?
ru: Вы шутите, да?

source: What if he gets hurt because he can' t hear in a dangerous situation?
ru: Что если он поранится из- за того, что не услышит об опасности?

source: - There' s liability issues.
ru: - Это законное решение.

source: - Bring it in, fellas.
ru: - Подойдите сюда, парни.

source: - Come on, bring it in.
ru: - Подойдите.

source: I want you guys to explain to them why they lost Jamal... and why Miles can' t wear headphones... and why the Bua Was and the Waatas have nice uniforms... and we have shitty T- shirts.
ru: Я хочу, чтобы вы объяснили им парни, почему Джамал не может играть... и почему Майлс не может играть в наушниках... и почему у той команды такая отличная форма... а у нас дерьмовые футболки.

source: Easy, Coach.
ru: Тише, тренер.

source: You' re already on a warning.
ru: Вы накличете беду.

source: This is the president... and that is the coach of the goofiest team in the league.
ru: Это президент... а это тренер тупейшей команды в лиге.

source: 'cause he' s pitchin' too good.
ru: Они дисквалифицировали Джамала, потому что он родился двумя неделями раньше... и теперь они хотят, чтобы Майлс снял свои наушники... потому что он слишком хорошо бросает.

source: It' s a safety issue.
ru: Спокойнее.

source: Fellas, you understand everyone has to follow the same rules.
ru: Парни, вы понимаете, что все следуют одним правилам.

source: That' s some weak- ass bullshit, you bitch- ass, mother- freakin 'bustas.
ru: Это потому что ты ублюдок сраный, недоделанный идиот и жирная задница.

source: I believe he said, "That is some weak- ass bullshit."
ru: Я думаю, что он сказал, "Это всё дерьмо собачье."

source: - Was that it, G- Baby?
ru: - Так, Джи- бейби?

source: - Yeah, that' s it.
ru: - Да, точно.

source: You are on thin ice, pal!
ru: Вы идёте по тонкому льду!

source: I could have you removed from this league.
ru: Я бы мог выкинуть вас из лиги за это.

source: This is my last game.
ru: Это моя последняя игра.

source: I' m out.
ru: Я вне игры.

source: I got business out of town.
ru: У меня есть дела в другом месте.

source: Kekambas, back on the field.
ru: Кекамбас, вернитесь на поле.

source: Son, no headphones.
ru: Сынок, без наушников.

source: Coaches, get back to the dugouts.
ru: Тренерам вернуться на скамейки.

source: Get out there.
ru: Давайте.

source: What' d you expect?
ru: А чего вы ждали?

source: I was gonna coach this team the whole year?
ru: Что я буду тренировать вашу команду весь год?

source: Rally, rally, the pitcher' s name is Sally!
ru: Ралли, ралли, а мяч бросает Салли!

source: All right, Calvin.
ru: Так, Кальвин.

source: Big stick now.
ru: Ударь- ка хорошенько.

source: What have you got, son?
ru: Чего ты ждёшь, сынок?

source: I just quit.
ru: - Не смотря ни на что, я ухожу.
